# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
#  Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
#   Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) 
#   в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, 
#   то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
#   Стихотворение  Винни-Пух вбивает в программу с клавиатуры. 
#   В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# *Пример:*

# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#     **Вывод:** Парам пам-пам  




dic = ('аоиыуэ')
list_1 = input('Напишите стихотворение: ')


def ritm(song):
    count=0
    sum=list()
    for i in song:
        if  i == 1 :
            count+=i 
        elif i == 0 and count>0: 
            sum.append(count) 
            count=0 
    if count>0:
        sum.append(count)
    for i in range(len(sum)-1):            
        if sum[i]!=sum[i+1]:
            return False
    return True



list_1 =(list(filter(lambda x: x in (dic + " "), list_1)))
list_1 = list(map(lambda x:1 if x!= " " else 0, list_1))

if ritm( list_1):
    print('Парам пам-пам')
else:
    print('Пам парам')









